//Soundex
//Известный алгоритм Soundex определяет, похожи ли два английских слова по звучанию. На вход он принимает слово и заменяет его на некоторый четырёхсимвольный код. Если коды двух слов совпадают, то слова, как правило, звучат похоже.
//
//Вам требуется реализовать этот алгоритм. Он работает так:
//
//Первая буква слова сохраняется.
//В остальной части слова буквы a, e, h, i, o, u, w и y удаляются;
//Оставшиеся буквы заменяются на цифры от 1 до 6, причём похожим по звучанию буквам соответствуют одинаковые цифры:
//b, f, p, v: 1
//c, g, j, k, q, s, x, z: 2
//d, t: 3
//l: 4
//m, n: 5
//r: 6
//
//Любая последовательность идущих подряд одинаковых цифр сокращается до одной такой цифры.
//Итоговая строка обрезается до первых четырёх символов.
//Если длина строки получилась меньше четырёх символов, в конце добавляются нули.
//Примеры:
//
//ammonium → ammnm → a5555 → a5 → a500.
//
//implementation → implmnttn → i51455335 → i514535 → i514.
//
//Формат ввода
//На вход подаётся одно непустое слово из строчных латинских букв. Длина слова не превосходит 20 символов.
//
//Формат вывода
//Напечатайте четырёхбуквенный код, соответствующий слову.

void soundex()
{
    
    return;
}
