//Обратная перестановка
//На мероприятие приглашены
//n гостей. Им предлагают занять места с номерами от 1 до
//n в зале. Гости занимают эти места в произвольном порядке. Известно, на каком месте сел очередной гость.
//
//Выпишите для каждого очередного места номер гостя, который на него сел.
//
//Формат ввода
//Дано число
//n, а затем
//n различных чисел от 1 до n (A1 A2 ... An). Число
//Ak — это номер места, на которое сел k-й гость.
//Число n не превосходит 20000.
//
//Формат вывода
//Выведите
//n чисел от 1 до n. Число Bk
//  должно обозначать номер гостя, который сел на
//k-е место.
